Miho-sama/BJTU_EE_UnderGraduate_GraduateDesign/STM32_AD7606_115200_1USB_4WIFI/Board/Source/tft_lcd.c
/****************************************************************************
* Copyright (C), 2009-2010, www.armfly.com
*
* 文件名: tft_lcd.c
* 内容简述: 本模块包含TFT LCD显示器的驱动函数。
*
*	安富莱开发板标配的TFT显示器的驱动芯片为 SPFD5420A，分辨率为400x240
*	驱动芯片的访问地址为
*		(1) 0x60000000
*
* 文件历史:
* 版本号  日期       作者    说明
* v0.1    2010-01-02 armfly  创建该文件
*
*/

#include "stm32f10x.h"
#include <stdio.h>
#include "Sys_base.h"
#include "tft_lcd.h"
#include "fonts.h"


typedef struct
{
	__IO uint16_t LCD_REG;
	__IO uint16_t LCD_RAM;
}
LCD_TypeDef;

/* 定义LCD驱动器的访问地址 */
#define LCD_BASE        ((uint32_t)(0x60000000 | 0x0C000000))
#define LCD             ((LCD_TypeDef *) LCD_BASE)

static __IO uint16_t s_TextColor = 0x0000;
static __IO uint16_t s_BackColor = 0xFFFF;

/* armfly添加透明标志
	s_Transparent = 1 表示显示文字时，不修改背景颜色
*/
static __IO uint8_t s_Transparent = 0;

/*******************************************************************************
*	函数名: LCD_Init
*	参  数: 无
*	返  回: 无
*	功  能: 初始化TFT显示器
*/						   
#define REV
void LCD_Init(void)
{
	/* 配置LCD控制口线GPIO */
	LCD_CtrlLinesConfig();

	/* 配置FSMC接口，数据总线 */
	LCD_FSMCConfig();

	/* FSMC重置后必须加延迟才能访问总线设备  */
	Delay_ms(20);

#ifdef REV
	LCD_WriteReg(0x0000, 0x0000);
	LCD_WriteReg(0x0000, 0x0000);
	LCD_WriteReg(0x0000, 0x0000);
	LCD_WriteReg(0x0000, 0x0000);
	Delay_ms(20); 
	LCD_WriteReg(0x0400, 0x6200);
	LCD_WriteReg(0x0008, 0x0808);
//gamma
	LCD_WriteReg(0x0300, 0x0C00);
	LCD_WriteReg(0x0301, 0x5A0B);
	LCD_WriteReg(0x0302, 0x0906);
	LCD_WriteReg(0x0303, 0x1017);
	LCD_WriteReg(0x0304, 0x2300);
	LCD_WriteReg(0x0305, 0x1700);
	LCD_WriteReg(0x0306, 0x6309);
	LCD_WriteReg(0x0307, 0x0C09);
	LCD_WriteReg(0x0308, 0x100C);
	LCD_WriteReg(0x0309, 0x2232);

	LCD_WriteReg(0x0010, 0x0016);      //69.5Hz         0016
	LCD_WriteReg(0x0011, 0x0101);
	LCD_WriteReg(0x0012, 0x0000);
	LCD_WriteReg(0x0013, 0x0001);

	LCD_WriteReg(0x0100, 0x0330);      //BT,AP
	LCD_WriteReg(0x0101, 0x0237);      //DC0,DC1,VC
	LCD_WriteReg(0x0103, 0x0D00);      //VDV
	LCD_WriteReg(0x0280, 0x6100);      //VCM
	LCD_WriteReg(0x0102, 0xC1B0);      //VRH,VCMR,PSON,PON
	Delay_ms(20); 

	LCD_WriteReg(0x0001, 0x0100);
	LCD_WriteReg(0x0002, 0x0100);
	LCD_WriteReg(0x0003, 0x1018);       //1030	设置增长方向  P42：Entry Mode (R003h)
	LCD_WriteReg(0x0009, 0x0001);
	LCD_WriteReg(0x000C, 0x0000);
	LCD_WriteReg(0x0090, 0x8000);
	LCD_WriteReg(0x000F, 0x0000);


	LCD_WriteReg(0x0210, 0x0000);	// 水平起始地址
	LCD_WriteReg(0x0211, 239);		// 水平结束坐标
	LCD_WriteReg(0x0212, 0x0000);	// 垂直起始地址 
	LCD_WriteReg(0x0213, 399);   	// 垂直结束地址    //432=01AF,400=018F


	LCD_WriteReg(0x0500, 0x0000);
	LCD_WriteReg(0x0501, 0x0000);
	LCD_WriteReg(0x0502, 0x005F);
	LCD_WriteReg(0x0401, 0x0001);
	LCD_WriteReg(0x0404, 0x0000);
	Delay_ms(20);

	LCD_WriteReg(0x0007, 0x0100);         //
	Delay_ms(20);
	LCD_WriteReg(0x0200, 0x0000);
	LCD_WriteReg(0x0201, 0x0000);
	LCD_WriteRAM_Prepare();
	LCD_WriteReg(0x0213, 399);	/* 垂直结束地址 */

#else
	/* 初始化LCD，写LCD寄存器进行配置 */
	LCD_WriteReg(0x0000, 0x0000);
	LCD_WriteReg(0x0001, 0x0100);
	LCD_WriteReg(0x0002, 0x0100);

	/*
		R003H 寄存器很关键， Entry Mode ，决定了扫描方向
		参见：SPFD5420A.pdf 第15页

		240x400屏幕物理坐标(px,py)如下:
		    R003 = 0x1018                  R003 = 0x1008
		  -------------------          -------------------
		 |(0,0)              |        |(0,0)              |
		 |                   |        |
		 |  ^           ^    |        |   ^           ^   |
		 |  |           |    |        |   |           |   |
		 |  |           |    |        |   |           |   |
		 |  |           |    |        |   |           |   |
		 |  |  ------>  |    |        |   | <------   |   |
		 |  |           |    |        |   |           |   |
		 |  |           |    |        |   |           |   |
		 |  |           |    |        |   |           |   |
		 |  |           |    |        |   |           |   |
		 |                   |        |
		 |                   |        |                   |
		 |      (x=239,y=399)|        |      (x=239,y=399)|
		 |-------------------|        |-------------------|
		 |                   |        |                   |
		  -------------------          -------------------

		按照安富莱开发板LCD的方向，我们期望的虚拟坐标和扫描方向如下：(和上图第1个吻合)
		 --------------------------------
		|  |(0,0)                        |
		|  |     --------->              |
		|  |         |                   |
		|  |         |                   |
		|  |         |                   |
		|  |         V                   |
		|  |     --------->              |
		|  |                    (399,239)|
		 --------------------------------

		虚拟坐标(x,y) 和物理坐标的转换关系
		x = 399 - py;
		y = px;

		py = 399 - x;
		px = y;

	*/
	LCD_WriteReg(0x0003, 0x1018); /* 0x1018 1030 */

	LCD_WriteReg(0x0008, 0x0808);
	LCD_WriteReg(0x0009, 0x0001);
	LCD_WriteReg(0x000B, 0x0010);
	LCD_WriteReg(0x000C, 0x0000);
	LCD_WriteReg(0x000F, 0x0000);
	LCD_WriteReg(0x0007, 0x0001);
	LCD_WriteReg(0x0010, 0x0013);
	LCD_WriteReg(0x0011, 0x0501);
	LCD_WriteReg(0x0012, 0x0300);
	LCD_WriteReg(0x0020, 0x021E);
	LCD_WriteReg(0x0021, 0x0202);
	LCD_WriteReg(0x0090, 0x8000);
	LCD_WriteReg(0x0100, 0x17B0);
	LCD_WriteReg(0x0101, 0x0147);
	LCD_WriteReg(0x0102, 0x0135);
	LCD_WriteReg(0x0103, 0x0700);
	LCD_WriteReg(0x0107, 0x0000);
	LCD_WriteReg(0x0110, 0x0001);
	LCD_WriteReg(0x0210, 0x0000);
	LCD_WriteReg(0x0211, 0x00EF);
	LCD_WriteReg(0x0212, 0x0000);
	LCD_WriteReg(0x0213, 0x018F);
	LCD_WriteReg(0x0280, 0x0000);
	LCD_WriteReg(0x0281, 0x0004);
	LCD_WriteReg(0x0282, 0x0000);
	LCD_WriteReg(0x0300, 0x0101);
	LCD_WriteReg(0x0301, 0x0B2C);
	LCD_WriteReg(0x0302, 0x1030);
	LCD_WriteReg(0x0303, 0x3010);
	LCD_WriteReg(0x0304, 0x2C0B);
	LCD_WriteReg(0x0305, 0x0101);
	LCD_WriteReg(0x0306, 0x0807);
	LCD_WriteReg(0x0307, 0x0708);
	LCD_WriteReg(0x0308, 0x0107);
	LCD_WriteReg(0x0309, 0x0105);
	LCD_WriteReg(0x030A, 0x0F04);
	LCD_WriteReg(0x030B, 0x0F00);
	LCD_WriteReg(0x030C, 0x000F);
	LCD_WriteReg(0x030D, 0x040F);
	LCD_WriteReg(0x030E, 0x0300);
	LCD_WriteReg(0x030F, 0x0701);
	LCD_WriteReg(0x0400, 0x3500);
	LCD_WriteReg(0x0401, 0x0001);
	LCD_WriteReg(0x0404, 0x0000);
	LCD_WriteReg(0x0500, 0x0000);
	LCD_WriteReg(0x0501, 0x0000);
	LCD_WriteReg(0x0502, 0x0000);
	LCD_WriteReg(0x0503, 0x0000);
	LCD_WriteReg(0x0504, 0x0000);
	LCD_WriteReg(0x0505, 0x0000);
	LCD_WriteReg(0x0600, 0x0000);
	LCD_WriteReg(0x0606, 0x0000);
	LCD_WriteReg(0x06F0, 0x0000);
	LCD_WriteReg(0x07F0, 0x5420);
	LCD_WriteReg(0x07DE, 0x0000);
	LCD_WriteReg(0x07F2, 0x00DF);
	LCD_WriteReg(0x07F3, 0x0810);
	LCD_WriteReg(0x07F4, 0x0077);
	LCD_WriteReg(0x07F5, 0x0021);
	LCD_WriteReg(0x07F0, 0x0000);
	LCD_WriteReg(0x0007, 0x0173);

	/* 设置显示窗口 WINDOWS */
	LCD_WriteReg(0x0210, 0);	/* 水平起始地址 */
	LCD_WriteReg(0x0211, 239);	/* 水平结束坐标 */
	LCD_WriteReg(0x0212, 0);	/* 垂直起始地址 */
	LCD_WriteReg(0x0213, 399);	/* 垂直结束地址 */
#endif
}

