Miho-sama/BJTU_EE_UnderGraduate_GraduateDesign/STM32_AD7606_115200_1USB_4WIFI/Board/Source/tft_lcd.c
/*******************************************************************************
*	函数名: LCD_SetTextColor
*	参  数: Color : 文本颜色
*	返  回: 无
*	功  能: 设置文本颜色，保存在全部变量s_TextColor
*/
void LCD_SetTextColor(__IO uint16_t Color)
{
	s_TextColor = Color;
}

/*******************************************************************************
*	函数名: LCD_SetBackColor
*	参  数: Color : 背景颜色
*	返  回: 无
*	功  能: 设置背景颜色，保存在全部变量 s_BackColor
*/
void LCD_SetBackColor(__IO uint16_t Color)
{
	s_BackColor = Color;
}

/*******************************************************************************
*	函数名: LCD_ClearLine
*	参  数: Line : 文本行号0 - 9
*	返  回: 无
*	功  能: 清除选定的文本行
*/
void LCD_ClearLine(uint8_t Line)
{
	LCD_DisplayString(0, Line, "                    ");
}

/*******************************************************************************
*	函数名: LCD_Clear
*	参  数: Color : 背景色
*	返  回: 无
*	功  能: 根据输入的颜色值清屏
*/
void LCD_Clear(uint16_t Color)
{
	uint32_t index = 0;

	LCD_SetCursor(0, 0);	/* 设置光标位置 */

	LCD_WriteRAM_Prepare(); 	/* 准备写显存 */

	for (index = 0; index < 400 * 240; index++)
	{
		LCD->LCD_RAM = Color;
	}
}

/*******************************************************************************
*	函数名: LCD_SetCursor
*	参  数: Xpos : X坐标; Ypos: Y坐标
*	返  回: 无
*	功  能: 设置光标位置
*/
void LCD_SetCursor(uint16_t Xpos, uint16_t Ypos)
{
	/*
		px，py 是物理坐标， x，y是虚拟坐标
		转换公式:
		py = 399 - x;
		px = y;
	*/

	LCD_WriteReg(0x0200, Ypos);  		/* px */
	LCD_WriteReg(0x0201, 399 - Xpos);	/* py */
}

/*******************************************************************************
*	函数名: LCD_SetTransparent
*	参  数: _mode ; 透明标志，1表示透明 0 表示不透明
*	返  回: 无
*	功  能: 设置光标位置
*/
void LCD_SetTransparent(uint8_t _mode)
{
	if (_mode == 0)
	{
		s_Transparent = 0;	/* 设置为背景不透明 */
	}
	else
	{
		s_Transparent = 1;	/* 设置为背景透明 */
	}
}

/*******************************************************************************
*	函数名: LCD_DrawChar
*	参  数:
*		Xpos : X坐标;
*		Ypos: Y坐标；
*		c : 指向字符点阵的指针
*		width : 点阵的宽度，字符是8，汉字是16
*	返  回: 无
*	功  能: 在LCD上显示一个字符(16x24)
*/
void LCD_DrawChar(uint16_t Xpos, uint16_t Ypos, const uint8_t *c, uint8_t width)
{
	uint32_t index = 0, i = 0;
	uint8_t Yaddress;

	Yaddress = Ypos;

	LCD_SetCursor(Xpos, Ypos);

	if (s_Transparent == 0)
	{
		for (index = 0; index < 16; index++)	/* 字符高度 */
		{
			LCD_WriteRAM_Prepare();
			for (i = 0; i < width; i++)	/* 字符宽度 */
			{
				if ((c[index * (width / 8) + i / 8] & (0x80 >> (i % 8))) == 0x00)
				{
					LCD_WriteRAM(s_BackColor);
				}
				else
				{
					LCD_WriteRAM(s_TextColor);
				}
			}
			Yaddress++;
			LCD_SetCursor(Xpos, Yaddress);
		}
	}
	else	/* armfly 添加：实现文字叠加在图片上的功能 */
	{
		for (index = 0; index < 16; index++)	/* 字符高度 */
		{
			uint16_t x = Xpos;

			for (i = 0; i < width; i++)	/* 字符宽度 */
			{
				if ((c[index * (width / 8) + i / 8] & (0x80 >> (i % 8))) != 0x00)
				{
					LCD_SetCursor(x, Yaddress);

					LCD->LCD_REG = 0x202;
					LCD->LCD_RAM = s_TextColor;
				}
				x++;
			}
			Yaddress++;
		}
	}
}

/*******************************************************************************
*	函数名: LCD_DisplayString
*	参  数:
*		Xpos : X坐标 0 - 399
*		Ypos : Y坐标 0 - 239
*		ptr  : 字符串指针；
*	返  回: 无
*	功  能: 在LCD指定文本行显示一个字符串
*/
void LCD_DisplayString(uint16_t Xpos, uint16_t Ypos, uint8_t *ptr)
{
	uint32_t i = 0;
	uint8_t code1;
	uint8_t code2;
	uint32_t address;


	while ((*ptr != 0) & (i < 50))
	{
		code1 = *ptr;	/* ascii代码 或者汉字代码的高字节 */
		if (code1 < 0x80)
		{
			LCD_DrawChar(Xpos, Ypos, &Ascii16[code1 * 16], 8);	/* 16 表示1个字符字模的字节数 */
			Xpos += 8;		/* 列地址+8 */
		}
		else	/* 汉字内码 */
		{
			code2 = *++ptr;
			if (code2 == 0)
			{
				break;
			}
			/* 计算16点阵汉字点阵地址
				ADDRESS = [(code1-0xa1) * 94 + (code2-0xa1)] * 32
				;
			*/
			address = ((code1-0xa1) * 94 + (code2-0xa1)) * 32 + HZK16_ADDR;
			LCD_DrawChar(Xpos, Ypos, (const uint8_t *)address, 16);
			Xpos += 16;		/* 列地址+16 */
		}
		ptr++;			/* 指向下一个字符 */
		i++;
	}
}

/*******************************************************************************
*	函数名: LCD_SetDisplayWindow
*	参  数:
*		Xpos : 显示行号
*		Ypos  : 字符串指针；
*		Height: 窗口高度
*		Width : 窗口宽度
*	返  回: 无
*	功  能: 设置显示窗口
*/
void LCD_SetDisplayWindow(uint16_t Xpos, uint16_t Ypos, uint16_t Height, uint16_t Width)
{
	/* 水平起始地址 */
	if (Xpos >= Height)
	{
		LCD_WriteReg(R80, (Xpos - Height + 1));
	}
	else
	{
		LCD_WriteReg(R80, 0);
	}

	/* 水平结束地址 */
	LCD_WriteReg(R81, Xpos);

	/* 垂直起始地址 */
	if (Ypos >= Width)
	{
		LCD_WriteReg(R82, (Ypos - Width + 1));
	}
	else
	{
		LCD_WriteReg(R82, 0);
	}

	/* 垂直结束地址 */
	LCD_WriteReg(R83, Ypos);

	LCD_SetCursor(Xpos, Ypos);
}

/*******************************************************************************
*	函数名: LCD_WindowModeDisable
*	参  数: 无
*	返  回: 无
*	功  能: 退出窗口显示模式，变为全屏显示模式
*/
void LCD_WindowModeDisable(void)
{
	LCD_SetDisplayWindow(239, 399, 240, 400);
	LCD_WriteReg(R3, 0x1018);	/* 这个寄存器改变扫描方向 */
}

/*******************************************************************************
*	函数名: LCD_DrawLine
*	参  数: Xpos ：X坐标
*			YPos ：Y坐标
*			Length    ：长度
*			Direction ：方向(Horizontal，Vertical)
*	返  回: 无
*	功  能: 在LCD上画1条线
*/
void LCD_DrawLine(uint16_t Xpos, uint16_t Ypos, uint16_t Length, uint8_t Direction)
{
	uint32_t i = 0;

	/* 设置线的起始坐标 */
	LCD_SetCursor(Xpos, Ypos);

	if (Direction == Horizontal)	/* 水平绘制 */
	{
		LCD_WriteRAM_Prepare();
		for (i = 0; i < Length; i++)
		{
			LCD_WriteRAM(s_TextColor);
		}
	}
	else	/* 垂直绘制 */
	{
		for (i = 0; i < Length; i++)
		{
			LCD_WriteRAM_Prepare();
			LCD_WriteRAM(s_TextColor);
			Ypos++;
			LCD_SetCursor(Xpos, Ypos);
		}
	}
}

/*******************************************************************************
*	函数名: LCD_DrawPoints
*	参  数: _points ：点坐标数组
*			_offset : 偏移坐标
*			_Size : 点个数
*			_Color ：颜色
*	返  回: 无
*	功  能: 在LCD上画一组点
*/
void LCD_DrawPoints(POINT_T _offset, POINT_T *_points, uint16_t _Size, uint16_t _Color)
{
#if 1
	uint16_t i;

	for (i = 0 ; i < _Size; i++)
	{
		/* 设置线的起始坐标 */
		LCD_SetCursor(_points[i].x + _offset.x, _points[i].y + _offset.y);
		/* 修改显存数据 */
		LCD_WriteReg(0x202, _Color);
	}
#else
	/* 下面是优化后的代码 */
	for (i = 0 ; i < _Size; i++)
	{
		LCD->LCD_REG = 0x0200;
		LCD->LCD_RAM = _points[i]->x;

		LCD->LCD_REG = 0x0201;
		LCD->LCD_RAM = _points[i]->y;

		LCD->LCD_REG = 0x0202;
		LCD->LCD_RAM = _Color;
	}
#endif

