Miho-sama/BJTU_EE_UnderGraduate_GraduateDesign/STM32_AD7606_115200_1USB_4WIFI/Board/Source/tft_lcd.c
}

/*******************************************************************************
*	函数名: LCD_DrawRect
*	参  数: Xpos ：X坐标
*			YPos ：Y坐标
*			Height ：高度
*			Width  ：宽度
*	返  回: 无
*	功  能: 在LCD上画一个矩形框
*/
void LCD_DrawRect(uint16_t Xpos, uint16_t Ypos, uint8_t Height, uint16_t Width)
{
	/*
	 ---------------->---
	|(Xpos，Ypos)        |
	V                    V  Height
	|                    |
	 ---------------->---
		  Width
	*/

	LCD_DrawLine(Xpos, Ypos, Width, Horizontal);  				/* 顶 */
	LCD_DrawLine(Xpos, Ypos + Height, Width, Horizontal);		/* 底 */

	LCD_DrawLine(Xpos, Ypos, Height, Vertical);					/* 左 */
	LCD_DrawLine(Xpos + Width, Ypos, Height, Vertical);	/* 右 */
}

/*******************************************************************************
*	函数名: LCD_DrawCircle
*	参  数: Xpos ：X坐标
*			Radius ：圆的半径
*	返  回: 无
*	功  能: 在LCD上画一个圆
*/
void LCD_DrawCircle(uint16_t Xpos, uint16_t Ypos, uint16_t Radius)
{
	int32_t  D;			/* Decision Variable */
	uint32_t  CurX;		/* 当前 X 值 */
	uint32_t  CurY;		/* 当前 Y 值 */

	D = 3 - (Radius << 1);
	CurX = 0;
	CurY = Radius;

	while (CurX <= CurY)
	{
		LCD_SetCursor(Xpos + CurX, Ypos + CurY);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(s_TextColor);

		LCD_SetCursor(Xpos + CurX, Ypos - CurY);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(s_TextColor);

		LCD_SetCursor(Xpos - CurX, Ypos + CurY);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(s_TextColor);

		LCD_SetCursor(Xpos - CurX, Ypos - CurY);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(s_TextColor);

		LCD_SetCursor(Xpos + CurY, Ypos + CurX);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(s_TextColor);

		LCD_SetCursor(Xpos + CurY, Ypos - CurX);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(s_TextColor);

		LCD_SetCursor(Xpos - CurY, Ypos + CurX);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(s_TextColor);

		LCD_SetCursor(Xpos - CurY, Ypos - CurX);
		LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
		LCD_WriteRAM(s_TextColor);

		if (D < 0)
		{
			D += (CurX << 2) + 6;
		}
		else
		{
			D += ((CurX - CurY) << 2) + 10;
			CurY--;
		}
		CurX++;
	}
}

/*******************************************************************************
*	函数名: LCD_DrawMonoPict
*	参  数: Pict ： 图片点阵指针
*	返  回: 无
*	功  能: 在LCD上画一个单色图片
*/
void LCD_DrawMonoPict(const uint32_t *Pict)
{
	uint32_t index = 0, i = 0;

	LCD_SetCursor(0, 400);

	LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
	for (index = 0; index < 2400; index++)
	{
		for (i = 0; i < 32; i++)
		{
			if ((Pict[index] & (1 << i)) == 0x00)
			{
				LCD_WriteRAM(s_BackColor);
			}
			else
			{
				LCD_WriteRAM(s_TextColor);
			}
		}
	}
}

/*******************************************************************************
*	函数名: LCD_WriteBMP
*	参  数: ptr ： 图片点阵指针
*	返  回: 无
*	功  能: 在LCD上显示一个BMP位图
*/
void LCD_WriteBMP(const uint16_t *ptr)
{
	uint32_t index = 0;
	const uint16_t *p;

	/* 修改扫描方向 */
	/* Set GRAM write direction and BGR = 1 */
	/* I/D=00 (Horizontal : decrement, Vertical : decrement) */
	/* AM=1 (address is updated in vertical writing direction) */
	//LCD_WriteReg(R3, 0x1008);

	LCD_WriteRAM_Prepare();

	p = ptr;
	for (index = 0; index < 400 * 240; index++)
	{
		/*
			armfly : 进行优化, 函数就地展开
			LCD_WriteRAM(ptr[index]);

			此处可考虑用DMA操作
		*/
		LCD->LCD_RAM = *p++;
	}

	/* 还原扫描方向 */
	/* Set GRAM write direction and BGR = 1 */
	/* I/D = 01 (Horizontal : increment, Vertical : decrement) */
	/* AM = 1 (address is updated in vertical writing direction) */
	//LCD_WriteReg(R3, 0x1018);
}


void Dis_PIC(const uint8_t  *p)
{
	int i,j;
	uint16_t temp;

	LCD_SetCursor(0, 0);
	LCD_WriteRAM_Prepare(); /* Prepare to write GRAM */
	for(i=0;i<400;i++)
	 {
	  for (j=0;j<240;j++)
	   	{
		 temp=*(p+1);
		 temp=temp<<8;
		 temp+=*p;
		 LCD->LCD_RAM=temp;
		 //R61509V_WR_DATA((*p)+(*(p+1))<<8);  //这样算越界了！！！
		p=p+2;
	    }

	  }	

}


/*******************************************************************************
*	函数名: LCD_WriteReg
*	参  数: LCD_Reg ：寄存器地址;  LCD_RegValue : 寄存器值
*	返  回: 无
*	功  能: 修改LCD控制器的寄存器的值
*/
void LCD_WriteReg(__IO uint16_t LCD_Reg, uint16_t LCD_RegValue)
{
	/* Write 16-bit Index, then Write Reg */
	LCD->LCD_REG = LCD_Reg;
	/* Write 16-bit Reg */
	LCD->LCD_RAM = LCD_RegValue;
}

/*******************************************************************************
*	函数名: LCD_ReadReg
*	参  数: LCD_Reg ：寄存器地址
*	返  回: 寄存器的值
*	功  能: 读LCD控制器的寄存器的值
*/
uint16_t LCD_ReadReg(__IO uint16_t LCD_Reg)
{
	/* Write 16-bit Index (then Read Reg) */
	LCD->LCD_REG = LCD_Reg;
	/* Read 16-bit Reg */
	return (LCD->LCD_RAM);
}

/*******************************************************************************
*	函数名: LCD_WriteRAM_Prepare
*	参  数: 无
*	返  回: 无
*	功  能: 写显存前的准备，即设置显存寄存器地址。
*/
void LCD_WriteRAM_Prepare(void)
{
	LCD->LCD_REG = 0x202;
}

/*******************************************************************************
*	函数名: LCD_WriteRAM
*	参  数: RGB_Code : 颜色代码
*	返  回: 无
*	功  能: 写显存，显存地址自动增加
*/
void LCD_WriteRAM(uint16_t RGB_Code)
{
	/* Write 16-bit GRAM Reg */
	LCD->LCD_RAM = RGB_Code;
}

/*******************************************************************************
*	函数名: LCD_ReadRAM
*	参  数: 无
*	返  回: 显存数据
*	功  能: 读显存，地址自动增加
*/
uint16_t LCD_ReadRAM(void)
{
#if 0
  /* Write 16-bit Index (then Read Reg) */
  LCD->LCD_REG = 0x202; /* Select GRAM Reg */
#endif

  /* Read 16-bit Reg */
  return LCD->LCD_RAM;
}

/*******************************************************************************
*	函数名: LCD_DisplayOn
*	参  数: 无
*	返  回: 无
*	功  能: 打开显示
*/
void LCD_DisplayOn(void)
{
	/* Display On */
	LCD_WriteReg(R7, 0x0173); /* 262K color and display ON */
}

/*******************************************************************************
*	函数名: LCD_DisplayOff
*	参  数: 无
*	返  回: 无
*	功  能: 关闭显示
*/
void LCD_DisplayOff(void)
{
	/* Display Off */
	LCD_WriteReg(R7, 0x0);
}

